In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame

In [2]:
data= {'Yil':[2021,2020,2019,2018,2017,2016,2015,2010],
       'Aholi_soni':[33.9,33.5,32.9,32.5,31.9,31.4,30.9,28.5],
       'Temp':[1.54,1.48,1.56,1.62,1.65,1.66,1.64,1.53]}

In [3]:
df=DataFrame(data)

In [4]:
df

    Yil  Aholi_soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [5]:
df.head()

    Yil  Aholi_soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65

In [6]:
df.Temp

0    1.54
1    1.48
2    1.56
3    1.62
4    1.65
5    1.66
6    1.64
7    1.53
Name: Temp, dtype: float64

In [7]:
df.Aholi_soni

0    33.9
1    33.5
2    32.9
3    32.5
4    31.9
5    31.4
6    30.9
7    28.5
Name: Aholi_soni, dtype: float64

In [8]:
df['Aholi_soni']

0    33.9
1    33.5
2    32.9
3    32.5
4    31.9
5    31.4
6    30.9
7    28.5
Name: Aholi_soni, dtype: float64

In [9]:
df.YAIM=1600

In [10]:
df

    Yil  Aholi_soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [11]:
df=DataFrame(data,columns=['Yil','Aholi_soni','Temp','YAIM'],index=[21,20,19,18,17,16,15,10])

In [12]:
df

     Yil  Aholi_soni  Temp YAIM
21  2021        33.9  1.54  NaN
20  2020        33.5  1.48  NaN
19  2019        32.9  1.56  NaN
18  2018        32.5  1.62  NaN
17  2017        31.9  1.65  NaN
16  2016        31.4  1.66  NaN
15  2015        30.9  1.64  NaN
10  2010        28.5  1.53  NaN

In [13]:
value=pd.Series([1500,1560,1270],index=[21,18,10])

In [14]:
value

21    1500
18    1560
10    1270
dtype: int64

In [15]:
df.YAIM=value

In [16]:
df

     Yil  Aholi_soni  Temp    YAIM
21  2021        33.9  1.54  1500.0
20  2020        33.5  1.48     NaN
19  2019        32.9  1.56     NaN
18  2018        32.5  1.62  1560.0
17  2017        31.9  1.65     NaN
16  2016        31.4  1.66     NaN
15  2015        30.9  1.64     NaN
10  2010        28.5  1.53  1270.0

In [17]:
YAIM=[1700,1670,1600,1590,1400,1300,1350,1360]

In [18]:
df['YAIM']=YAIM

In [19]:
df

     Yil  Aholi_soni  Temp  YAIM
21  2021        33.9  1.54  1700
20  2020        33.5  1.48  1670
19  2019        32.9  1.56  1600
18  2018        32.5  1.62  1590
17  2017        31.9  1.65  1400
16  2016        31.4  1.66  1300
15  2015        30.9  1.64  1350
10  2010        28.5  1.53  1360

In [20]:
df['1500+']=df.YAIM>1500

In [21]:
df

     Yil  Aholi_soni  Temp  YAIM  1500+
21  2021        33.9  1.54  1700   True
20  2020        33.5  1.48  1670   True
19  2019        32.9  1.56  1600   True
18  2018        32.5  1.62  1590   True
17  2017        31.9  1.65  1400  False
16  2016        31.4  1.66  1300  False
15  2015        30.9  1.64  1350  False
10  2010        28.5  1.53  1360  False

In [22]:
del df['1500+']

In [23]:
df

     Yil  Aholi_soni  Temp  YAIM
21  2021        33.9  1.54  1700
20  2020        33.5  1.48  1670
19  2019        32.9  1.56  1600
18  2018        32.5  1.62  1590
17  2017        31.9  1.65  1400
16  2016        31.4  1.66  1300
15  2015        30.9  1.64  1350
10  2010        28.5  1.53  1360

In [24]:
data1={'Uzbekistan':{2021:33.9,2020:33.5,2019:32.9,2018:32.5,2017:31.9},
'Kazakistan':{2021:18.9,2020:18.7,2019:18.5,2018:18.3,2017:19.1,2016:27.8}}

In [25]:
df1=pd.DataFrame(data1)

In [26]:
df1

      Uzbekistan  Kazakistan
2021        33.9        18.9
2020        33.5        18.7
2019        32.9        18.5
2018        32.5        18.3
2017        31.9        19.1
2016         NaN        27.8

In [27]:
df1.T

            2021  2020  2019  2018  2017  2016
Uzbekistan  33.9  33.5  32.9  32.5  31.9   NaN
Kazakistan  18.9  18.7  18.5  18.3  19.1  27.8

In [28]:
df1.columns

Index(['Uzbekistan', 'Kazakistan'], dtype='object')

In [29]:
'Tajikistan' in df1.columns

False

In [30]:
2020 in df1.index

True

In [31]:
indeks=df1.index

In [32]:
indeks

Index([2021, 2020, 2019, 2018, 2017, 2016], dtype='int64')

In [33]:
usernames={'anvar':'anvar2','olim':'olimtoy1','maryam':'maryam3','javohir':'javohir4'}

In [34]:
emails={'anvar':'anvar@g','olim':'olim.ru','maryam':'maryam.uz','javohir':'javoh5@gmail.com'}

In [35]:
data={'username':usernames,
      'email':emails}

In [36]:
df3=DataFrame(data)

In [37]:
df3

         username             email
anvar      anvar2           anvar@g
olim     olimtoy1           olim.ru
maryam    maryam3         maryam.uz
javohir  javohir4  javoh5@gmail.com

In [38]:
data2={'username':{'olim':'olimjon2','maryam':'maryam2020'},
'email':{'olim':'olimjon22','maryam':'maryam20'}}

In [39]:
data2

{'username': {'olim': 'olimjon2', 'maryam': 'maryam2020'},
 'email': {'olim': 'olimjon22', 'maryam': 'maryam20'}}

In [40]:
df5=DataFrame(data2)

In [41]:
df5

          username      email
olim      olimjon2  olimjon22
maryam  maryam2020   maryam20

In [42]:
df4=pd.concat([df3,df5])

In [43]:
df4

           username             email
anvar        anvar2           anvar@g
olim       olimtoy1           olim.ru
maryam      maryam3         maryam.uz
javohir    javohir4  javoh5@gmail.com
olim       olimjon2         olimjon22
maryam   maryam2020          maryam20

In [44]:
df4.T

,anvar,olim,maryam,javohir,olim,maryam
username,anvar2,olimtoy1,maryam3,javohir4,olimjon2,maryam2020
email,anvar@g,olim.ru,maryam.uz,javoh5@gmail.com,olimjon22,maryam20

In [45]:
'Tajikistan' in df4.columns

False

In [46]:
2020 in df.index

False

In [47]:
df4.index

Index(['anvar', 'olim', 'maryam', 'javohir', 'olim', 'maryam'], dtype='object')

In [48]:
newind=pd.Index(['olim','nafisa','hamida'])

In [49]:
newind

Index(['olim', 'nafisa', 'hamida'], dtype='object')

In [50]:
newind.isin(df4.index) #newind df4 ichida borligini tekshirish

array([ True, False, False])

In [51]:
df4.index.difference(newind)

Index(['anvar', 'javohir', 'maryam'], dtype='object')

In [52]:
newind.difference(df4.index)

Index(['hamida', 'nafisa'], dtype='object')

In [53]:
df4.index.union(newind)

Index(['anvar', 'hamida', 'javohir', 'maryam', 'maryam', 'nafisa', 'olim',
       'olim'],
      dtype='object')

In [54]:
df4.index.delete(0)

Index(['olim', 'maryam', 'javohir', 'olim', 'maryam'], dtype='object')

In [55]:
df4

           username             email
anvar        anvar2           anvar@g
olim       olimtoy1           olim.ru
maryam      maryam3         maryam.uz
javohir    javohir4  javoh5@gmail.com
olim       olimjon2         olimjon22
maryam   maryam2020          maryam20

In [58]:
df4.index.drop('olim')

Index(['anvar', 'maryam', 'javohir', 'maryam'], dtype='object')

In [60]:
df4

           username             email
anvar        anvar2           anvar@g
olim       olimtoy1           olim.ru
maryam      maryam3         maryam.uz
javohir    javohir4  javoh5@gmail.com
olim       olimjon2         olimjon22
maryam   maryam2020          maryam20

In [61]:
df4.index.insert(3,'ali')

Index(['anvar', 'olim', 'maryam', 'ali', 'javohir', 'olim', 'maryam'], dtype='object')

In [64]:
df4.index.is_monotonic_increasing

False

In [66]:
df4.index.is_monotonic_decreasing

False

In [67]:
df4.index.is_unique

False

In [70]:
newind.is_unique

True

In [72]:
df4.index.unique()

Index(['anvar', 'olim', 'maryam', 'javohir'], dtype='object')

In [75]:
# qayta indexlash

In [78]:
data6={'Yil':[2021,2020,2019,2018,2017,2016,2015,2010],
       'Aholi soni':[33.9,33.5,32.9,32.3,31.4,30.9,28.5,90.4],
       'Temp':[1.54,1.48,1.56,1.62,1.65,1.66,1.64,1.53],
       'Zichlik':[79.77,78.88,77.53,76.34,75.13,73.23,67.03,77.77]}

In [81]:
df7=pd.DataFrame(data6)

In [85]:
df7

    Yil  Aholi soni  Temp  Zichlik
0  2021        33.9  1.54    79.77
1  2020        33.5  1.48    78.88
2  2019        32.9  1.56    77.53
3  2018        32.3  1.62    76.34
4  2017        31.4  1.65    75.13
5  2016        30.9  1.66    73.23
6  2015        28.5  1.64    67.03
7  2010        90.4  1.53    77.77

In [87]:
ind=[21,20,19,18,17,16,15,10]

In [89]:
df7.index=ind

In [91]:
df7

     Yil  Aholi soni  Temp  Zichlik
21  2021        33.9  1.54    79.77
20  2020        33.5  1.48    78.88
19  2019        32.9  1.56    77.53
18  2018        32.3  1.62    76.34
17  2017        31.4  1.65    75.13
16  2016        30.9  1.66    73.23
15  2015        28.5  1.64    67.03
10  2010        90.4  1.53    77.77

In [92]:
ind.sort()

In [94]:
ind

[10, 15, 16, 17, 18, 19, 20, 21]

In [96]:
df7.reindex(ind)

     Yil  Aholi soni  Temp  Zichlik
10  2010        90.4  1.53    77.77
15  2015        28.5  1.64    67.03
16  2016        30.9  1.66    73.23
17  2017        31.4  1.65    75.13
18  2018        32.3  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.88
21  2021        33.9  1.54    79.77

In [98]:
df7.reindex(range(10,23))

       Yil  Aholi soni  Temp  Zichlik
10  2010.0        90.4  1.53    77.77
11     NaN         NaN   NaN      NaN
12     NaN         NaN   NaN      NaN
13     NaN         NaN   NaN      NaN
14     NaN         NaN   NaN      NaN
15  2015.0        28.5  1.64    67.03
16  2016.0        30.9  1.66    73.23
17  2017.0        31.4  1.65    75.13
18  2018.0        32.3  1.62    76.34
19  2019.0        32.9  1.56    77.53
20  2020.0        33.5  1.48    78.88
21  2021.0        33.9  1.54    79.77
22     NaN         NaN   NaN      NaN

In [100]:
df7.reindex(index=range(10,23),method='ffill')

       Yil  Aholi soni  Temp  Zichlik
10  2010.0        90.4  1.53    77.77
11  2015.0        28.5  1.64    67.03
12  2015.0        28.5  1.64    67.03
13  2015.0        28.5  1.64    67.03
14  2015.0        28.5  1.64    67.03
15  2015.0        28.5  1.64    67.03
16  2016.0        30.9  1.66    73.23
17  2017.0        31.4  1.65    75.13
18  2018.0        32.3  1.62    76.34
19  2019.0        32.9  1.56    77.53
20  2020.0        33.5  1.48    78.88
21  2021.0        33.9  1.54    79.77
22     NaN         NaN   NaN      NaN

In [102]:
df7=df7.reindex(index=range(10,23),method='nearest')

In [105]:
df7

     Yil  Aholi soni  Temp  Zichlik
10  2010        90.4  1.53    77.77
11  2010        90.4  1.53    77.77
12  2010        90.4  1.53    77.77
13  2015        28.5  1.64    67.03
14  2015        28.5  1.64    67.03
15  2015        28.5  1.64    67.03
16  2016        30.9  1.66    73.23
17  2017        31.4  1.65    75.13
18  2018        32.3  1.62    76.34
19  2019        32.9  1.56    77.53
20  2020        33.5  1.48    78.88
21  2021        33.9  1.54    79.77
22  2021        33.9  1.54    79.77

In [107]:
df7=df7.reindex(columns=['Aholi soni','Temp','Zichlik'])

In [110]:
df7.sample(3)

    Aholi soni  Temp  Zichlik
22        33.9  1.54    79.77
10        90.4  1.53    77.77
11        90.4  1.53    77.77

In [111]:
df7.loc[[10,20,19],['Aholi soni','Zichlik']]

    Aholi soni  Zichlik
10        90.4    77.77
20        33.5    78.88
19        32.9    77.53

In [118]:
# qator vaustunlarni tashlab yuborish

In [121]:
df

     Yil  Aholi_soni  Temp  YAIM
21  2021        33.9  1.54  1700
20  2020        33.5  1.48  1670
19  2019        32.9  1.56  1600
18  2018        32.5  1.62  1590
17  2017        31.9  1.65  1400
16  2016        31.4  1.66  1300
15  2015        30.9  1.64  1350
10  2010        28.5  1.53  1360

In [123]:
df.drop(10)

     Yil  Aholi_soni  Temp  YAIM
21  2021        33.9  1.54  1700
20  2020        33.5  1.48  1670
19  2019        32.9  1.56  1600
18  2018        32.5  1.62  1590
17  2017        31.9  1.65  1400
16  2016        31.4  1.66  1300
15  2015        30.9  1.64  1350

In [125]:
df.drop([15,20])

     Yil  Aholi_soni  Temp  YAIM
21  2021        33.9  1.54  1700
19  2019        32.9  1.56  1600
18  2018        32.5  1.62  1590
17  2017        31.9  1.65  1400
16  2016        31.4  1.66  1300
10  2010        28.5  1.53  1360

In [128]:
df.drop('Yil',axis=1)

    Aholi_soni  Temp  YAIM
21        33.9  1.54  1700
20        33.5  1.48  1670
19        32.9  1.56  1600
18        32.5  1.62  1590
17        31.9  1.65  1400
16        31.4  1.66  1300
15        30.9  1.64  1350
10        28.5  1.53  1360

In [130]:
df

     Yil  Aholi_soni  Temp  YAIM
21  2021        33.9  1.54  1700
20  2020        33.5  1.48  1670
19  2019        32.9  1.56  1600
18  2018        32.5  1.62  1590
17  2017        31.9  1.65  1400
16  2016        31.4  1.66  1300
15  2015        30.9  1.64  1350
10  2010        28.5  1.53  1360

In [131]:
df.drop('Yil',axis='columns',inplace=True)

In [134]:
df

    Aholi_soni  Temp  YAIM
21        33.9  1.54  1700
20        33.5  1.48  1670
19        32.9  1.56  1600
18        32.5  1.62  1590
17        31.9  1.65  1400
16        31.4  1.66  1300
15        30.9  1.64  1350
10        28.5  1.53  1360

In [136]:
df.drop([10,15,20],inplace=True)

In [187]:
df

    Aholi_soni  Temp  YAIM
21        33.9  1.54  1700
19        32.9  1.56  1600
18        32.5  1.62  1590
17        31.9  1.65  1400
16        31.4  1.66  1300